{
    "Content": {
        "moi": "<h1 class='main-title'>Qui suis-je ?</h1><div class='atributes'><span class='first-words'>Qualités</span> : <span class='atr-content'>déterminé, investi, curieux, à l'écoute,persévérant</span></div><div class='atributes'><span class='first-words'>Défauts</span> : <span class='atr-content'>réservé, minutieux, exigeant envers moi-même etenvers les autres</span></div><div class='atributes'><span class='first-words'>Ce que je déteste</span> : <span class='atr-content'> Le travail en l’absence de sens,analyser pour analyser. Apprendre sans savoir appliquer. </span></div><div class='atributes'><span class='first-words'>Mes difficultés</span> : <span class='atr-content'>Effectuer une tâche si je n’en comprendsou n’en voit un intérêt concret qu’il soit sur le long ou le court terme.</span></div><div class='atributes'><span class='first-words'>Compétences</span> : <span class='atr-content'>Compétences : Très bon niveau en math, physique, anglais, bonnes notions en développement (HTML, CSSqui ne sont pas des langages de programmation, JS, légères bases en Python), connaissances enmontage photo et vidéo</span></div><div class='atributes'><span class='first-words'>Ambition</span> : <span class='atr-content'>Créer et concrétiser mes propres idées etprojets , contribuer à des projets innovants</span></div> <span id='pool-link'></span><span id='toulouseIII-link'></span><span id='full-stack-link'></span><span id='pentester-link'></span>" ,
        "formation": "<h1 class='main-title'>Comment et dans quel Objectif ?</h1> <div class='secondary-title'>Comment : </div> <div class='tertiary-title'>EDS :</div> <div class='arg, uped'> <p>En première : Mathématiques, Physique-Chimie, NSI </p> <p> En terminale : Mathématiques ( + math expert), NSI </p> </div><div class='tertiary-title'>L'année de mon BAC</div> <div class='arg'> <p class='pad'>Concourir à la <a href='javascript:void(0);' class='link' id='pool-link'>piscine</a> * de l’école 42 de Paris en août (afin que cela n'impacte pas mon cursus scolaire) et candidater à <em>Toulouse III</em> en licence informatique. </p> <p class='pad'>L’objectif de la <em>piscine</em> dans mon cas n’est pas réellement d’ingérer l’école 42 mais plutôt de me tester dans des conditions extrêmes de travail. Ne comptant pas faire de CPGE, la <em>piscine</em> (qui par ailleurs est gratuite comme l’entièreté du cursus de l’école 42) est pour moi l’occasion de me tester dans de telles conditions de travail mais également de faire de nombreuses rencontres dans le domaine dans lequel je compte évoluer professionnellement. </p> </div> <div class='tertiary-title'>Parcours Post-BAC :</div> <ol> <li>Licence informatique à Université <a href='javascript:void(0);' class='link' id='toulouseIII-link'>Toulouse III</a> ** Paul Sabatier durant trois ans avec un total de 343 places. Il s'âgit donc d'une L3 ce qui m'octroiera 180 <a class='link' href='https: //diplomeo.com/actualite-credits_ects_european_credits_transfer_system' target='_blank'>crédits ECTS</a> </li> <li>M1DL, un Master d'une année en développement logiciel à <em>Toulouse III</em> pendant deux ans avec environ 80 places pour en moyenne 250 candidatures (dont seulement 150 plaçant ce master en premier choix). Il faut également savoir que les chances d'être pris sont fortement accrues avec une L3 informatique d’autant plus si elle a été passée dans l'établissement. Cette année de Master m'apporte pour sa part 60 crédits ECTS ce qui fait un total de 240 crédits</li> <li>M2DL, la deuxième année de Master m'emmenant à 300 crédits ECTS, à BAC +5 et au titre d'ingénieur. Pour cette deuxième année, deux choix sont envisageables : <ul> <li>À Toulouse III où je serai accepté d’office car j’y aurais fait mon M1DL. Je pourrais durant cette deuxième année me spécialiser dans certains domaines grâce à 3 UE de recherche : IA (intelligence artificielle), modélisation, analyse, ... </li> <li>À Grenoble INP ENSIMAG afin de conclure sur un Master CyberSecurity (CySec), formation d’un an qui se fait exclusivement en Anglais et permet de se spécialiser en cybersécurité. Nécessite 240 crédits ECTS ainsi que des études scientifiques de préférence en informatique (ce qui sera donc entièrement complété grâce à la licence et la première année de master)</li> </ul> </li> <li>Possibilité éventuelle de devenir doctorant en m’orientant dans la recherche et en soutenant une thèse en génie logiciel ou en intelligence artificielle par exemple, ce qui m'emmenerait à un niveau d'étude entre BAC +7 et BAC +9, en fonction de la complexité du doctorat. </li> </ol> <p class='comment' id='pool'>* La piscine est le nom donné à l’épreuve d’entrée à l’école 42. Il s'agit d’un mois de mise à l’épreuve extrême durant lequel environ 20 % des participants abandonnent et environ 1/4 sont pris. Par extrême il faut comprendre des journées de 11 à 15h de travail, tous les jours (week-end compris) et ce pendant 4 semaines. </p> <p class='comment' id='toulouseIII'>** Heureux hasard, l’une des licences de la sorte ayant le plus de valeur est celle délivrée à Toulouse III mais c’est surtout la seule université proposant le Master en développement logiciel </p> <div class='secondary-title'>Dans quel objectif :</div> <p> Tout comme il y a deux possibilités quant à ma deuxième année de master, il y a deux domaines possibles en finalité de mes études. Ces deux domaines sont très proches et dépendent du M2 que je choisirai : </p> <ul> <li>Si je choisis le M2 à Grenoble, ce qui est l'option que je considère le plus aujourd'hui, je sortirai de mes études avec une formation de développeur <a href='javascript:void(0);' class='link' id='full-stack-link'>FullStack</a> accompagnée d'une spécialisation en cybersécurité. Cette spécialisation peut paraître anodine mais est en fait très importante car elle me permet l’accès au titre d’expert en Cybersécurité au sens large. Le dit titre est important car il signifie que je suis qualifié pour différents postes comme : <a href='javascript:void(0);' class='link' id='pentester-link'>Pentester</a>, chargé de Cybersécurité, consultant en cybersécurité,... Mais m’ouvre également les portes d'agences comme l’<a href='https: //www.ssi.gouv.fr/' class='link' target='_blank'>ANSSI</a> (Agence Nationale de la Sécurité des Systèmes d’Information) mais surtout de la <a href='https: //www.defense.gouv.fr/dgse/' class='link' target='_blank'>DGSE</a> et de la <a href='https: //www.interieur.gouv.fr/Le-ministere/DGSI' class='link' target='_blank'>DGSI</a> (Direction Générale de la Sécurité Extérieure/Intérieure). </li>  <li id='full-stack'>Si je choisis le M2 à Toulouse, je devient développeur <em>FullStack</em> avec une formation plus poussée qu'à Grenoble. <em>FullStack</em> définit un développeur maîtrisant les notions de <em>FrontEnd</em> et de <em>BackEnd</em>. Le <em>FrontEnd</em> représente l'interface utilisateur, le moyen pour l'utilisateur d'interagir avec la partie <em>BackEnd</em>. Cette partie est invisible pour l'utilisateur mais est pourtant nécessaire au fonctionnement de n'importe quelle. Le <em>BackEnd</em> représente par exemple tout le code qui, lorsque vous achetez sur un site marchand, va permettre la mise à jour des stocks, le paiment sécurisé, la mise en contact avec le service de livraison,... plateforme </li> </ul> <p class='comment' id='pentester'>Diminutif de penetration tester, il peut aussi être appelé ethical hacker. Le but du pentester et d’attaquer l’organisme (public ou privé) pour lequel il travail afin de trouver les failles de sécurité et les fixer avant que des d’autres utilisateurs, eux malintentionnés, utilisent ces failles à leurs fins. Pour plus d'informations, je vous redirige vers la page du <a href='https: //www.cidj.com/metiers/pentester' class='link' target='_blank'>CIDJ</a> relatant de ce métier</p>",
        "why": "<h1> Pourquoi ce choix </h1> <span id='pool-link'></span><span id='toulouseIII-link'></span><span id='full-stack-link'></span><span id='pentester-link'></span>"
    }
}